{
  "topic": "The Entire Life of Queen Nzinga, Who Negotiated With the Portuguese While Sitting on a Servant",
  "sections": {
    "Section1": {
      "title": "Born Into a Kingdom of Storms",
      "summary": "You arrive into the royal court of Ndongo as Nzinga, daughter of a warrior king, where politics swirl like the summer rains outside your cradle."
    },
    "Section2": {
      "title": "Taught by Fire and River",
      "summary": "You grow up learning diplomacy from your father, tactics from your brothers, and rituals from your mother, your mind as sharp as the spear you learn to wield."
    },
    "Section3": {
      "title": "The Blood Price of Ambition",
      "summary": "As your brother rises to the throne, you witness power twist men into paranoia—and feel the sting of betrayal as he turns against you."
    },
    "Section4": {
      "title": "A Chair Made of Flesh",
      "summary": "You enter a Portuguese court alone, unbowed, and when they offer no chair, you turn a human being into your throne—leaving no doubt who holds the power."
    },
    "Section5": {
      "title": "The Treaty of Tongues and Daggers",
      "summary": "Your words disarm them, your silence unnerves them, and with a treaty inked in cunning, you delay invasion and win breathing room for your people."
    },
    "Section6": {
      "title": "Exile on the Riverbank",
      "summary": "Cast out by your brother once more, you wander into the rainforest with a ragged court and find shelter in the lands of the fierce Matamba."
    },
    "Section7": {
      "title": "Crowned in the Forest Shadows",
      "summary": "When your brother dies, you rise—not as a regent or queen consort, but as sovereign of Ndongo and Matamba, cloaked in feathers and command."
    },
    "Section8": {
      "title": "Warrior Queen on the March",
      "summary": "You lead your armies into the thickets and plains, fighting Portuguese muskets with ambushes and alliances, every battle a message written in iron."
    },
    "Section9": {
      "title": "Allies, Intrigue, and the Jesuits’ Gaze",
      "summary": "You juggle Dutch weapons, African kings, and shifting loyalties, even as Christian missionaries arrive to reshape the story of your soul."
    },
    "Section10": {
      "title": "The Kingdom on Your Shoulders",
      "summary": "With each passing year, the burdens grow—supply lines thin, traitors stir, and you must rule not only through fear, but through vision."
    },
    "Section11": {
      "title": "The Scars of Faith and Power",
      "summary": "You are baptized to win political favor, but behind the crucifix lies the same blade—and still you must make peace without surrendering your crown."
    },
    "Section12": {
      "title": "The Last Campaign",
      "summary": "Older now but unbroken, you ride once more to rally the scattered tribes, your banner still snapping against the sky like thunder."
    },
    "Section13": {
      "title": "Peace by Her Own Terms",
      "summary": "You kneel not in submission but in strategy, as you forge a lasting peace—one that keeps your lands and your lineage intact."
    },
    "Section14": {
      "title": "The Queen and the Quiet Years",
      "summary": "In the stillness of twilight, you reflect on decades of fire and negotiation, watching young leaders train under your gaze as matriarch of a changing world."
    },
    "Section15": {
      "title": "A Throne That Did Not Bend",
      "summary": "Your body fades, but your legend deepens—etched in oral tales, European records, and the memory of a queen who turned flesh into iron."
    }
  }
}