{
  "topic": "The Entire Life of Queen Nzinga, Who Negotiated With the Portuguese While Sitting on a Servant",
  "sections": {
    "Section1": {
      "title": "Born Beneath the Baobab",
      "summary": "You arrive in the royal court of Ndongo, where cries of power and prophecy fill the air as a future queen is born into war."
    },
    "Section2": {
      "title": "Lessons in a Warrior's Shadow",
      "summary": "Your father trains you not just in royal customs but in the language of warriors, blades, and cunning diplomacy."
    },
    "Section3": {
      "title": "A Kingdom Besieged",
      "summary": "The Portuguese press deeper into Angola, and you watch as alliances splinter and fear grows in the eyes of your people."
    },
    "Section4": {
      "title": "Blood, Betrayal, and the Throne",
      "summary": "Your brother ascends the throne—but mistrust blooms in his heart, and your survival begins to depend on silence and strategy."
    },
    "Section5": {
      "title": "The Servant Throne",
      "summary": "You enter Luanda in silk and steel, refusing to kneel before the Portuguese—so you make a throne from the back of a servant."
    },
    "Section6": {
      "title": "Sister, Exile, Queen",
      "summary": "Banished from court after your brother’s death, you vanish into the mountains—and reemerge with a crown forged by force."
    },
    "Section7": {
      "title": "The Kongo Alliance",
      "summary": "You marry strategically, ally with rebels, and offer sanctuary to the displaced—your power grows beyond Ndongo."
    },
    "Section8": {
      "title": "King Nzinga of Matamba",
      "summary": "You become ruler of Matamba and reshape its army, transforming a haven into a sovereign kingdom ready for war."
    },
    "Section9": {
      "title": "The Queen Who Fought in Chains",
      "summary": "You ride into battle with a musket in hand and shackles in memory, refusing to surrender your people or your pride."
    },
    "Section10": {
      "title": "Smoke Over Luanda",
      "summary": "You launch daring raids on Portuguese forts, burning their outposts and freeing enslaved villagers by the hundreds."
    },
    "Section11": {
      "title": "The Art of Delay",
      "summary": "You stretch time like a bowstring—playing envoys, priests, and soldiers against each other as you plan your final moves."
    },
    "Section12": {
      "title": "A Queen and Her Ghosts",
      "summary": "In the twilight of war, you whisper to ancestors, asking if peace is a wound or a gift yet to be unwrapped."
    },
    "Section13": {
      "title": "The Final Accord",
      "summary": "You negotiate once more with the Portuguese, older now, but unbowed—offering them peace, but on your terms alone."
    },
    "Section14": {
      "title": "The Last Breath of Nzinga",
      "summary": "Your life closes in quiet dignity, surrounded by loyal warriors and silent hopes for a future beyond chains."
    },
    "Section15": {
      "title": "The Throne Remembered",
      "summary": "Long after your death, stories of your rule ripple across continents—etched in memory, and in the unbent backs of the free."
    }
  }
}