{
  "topic": "Forgotten Aztec Gardening Tricks That Make Modern Permaculture Look Complicated",
  "sections": {
    "Section1": {
      "title": "Twilight over Tenochtitlán",
      "summary": "As the sun sets over a sprawling floating city, you glide silently in a canoe, drawn toward the ancient secrets of the Aztec gardens."
    },
    "Section2": {
      "title": "Chinampas Take Root",
      "summary": "You witness the miraculous emergence of man-made islands—woven from reeds and mud—as farmers begin to sculpt the lake itself into fertile land."
    },
    "Section3": {
      "title": "The Mud Alchemists",
      "summary": "You watch as gardeners stir together lake sediment, ash, and compost, transforming waste into rich, living soil that nourishes everything it touches."
    },
    "Section4": {
      "title": "Canals of Quiet Genius",
      "summary": "Moving through the shaded canals, you begin to see how the waterways serve not just as roads, but as irrigation, refrigeration, and lifelines."
    },
    "Section5": {
      "title": "Three Sisters and Beyond",
      "summary": "In a patch of garden, you kneel beside corn, beans, and squash—woven together in sacred geometry that feeds families and heals the land."
    },
    "Section6": {
      "title": "Hummingbirds in the Milpa",
      "summary": "As hummingbirds dart among the flowers, you learn how polycultures and native pollinators keep this living system perfectly in balance."
    },
    "Section7": {
      "title": "Compost Temples",
      "summary": "You pass heaps of decaying matter tended like shrines, and you begin to understand how the Aztecs honored life even in its end."
    },
    "Section8": {
      "title": "The Calendar in the Soil",
      "summary": "By moonlight, you trace the gardeners’ planting cycles—mapped not by clocks, but by celestial rhythms and sacred calendars older than memory."
    },
    "Section9": {
      "title": "Pest Control by Moon and Mind",
      "summary": "You observe farmers using chili smoke, frog songs, and lunar rituals to ward off pests—methods at once simple and spiritually tuned."
    },
    "Section10": {
      "title": "Medicine in the Maize Rows",
      "summary": "Amid the food crops, you find healing herbs—each placed with care, part of a garden that feeds body, spirit, and story."
    },
    "Section11": {
      "title": "The Floating Forests",
      "summary": "You drift past towering willows and mesquite trees rooted in chinampas—silent guardians that stabilize soil and summon rain with their shade."
    },
    "Section12": {
      "title": "When Water Speaks",
      "summary": "You pause to listen as farmers read ripples, soil moisture, and bird calls, adapting their planting with a grace modern systems struggle to match."
    },
    "Section13": {
      "title": "The Empire's Living Pantry",
      "summary": "From cacao to amaranth, you walk through gardens that don’t just feed the city—they store seeds, prayers, and genetic memory."
    },
    "Section14": {
      "title": "Collapse and Silence",
      "summary": "You witness the fall—canals choked, gardens drowned in conquest—and feel the hush descend over a civilization's green brilliance."
    },
    "Section15": {
      "title": "Roots That Remember",
      "summary": "As dawn breaks over a misty field, you realize the old ways live on—in soil, seeds, and the quiet hands of those who still listen."
    }
  }
}