{
  "topic": "A Gentle Stroll Through Victorian Insomnia Cures, From Lettuce Soup to Electric Helmets",
  "sections": {
    "Section1": {
      "title": "A Candlelit Night Begins",
      "summary": "You settle into a velvet chair in a quiet Victorian parlor, the fire crackling as the world of 19th-century sleep science flickers to life around you."
    },
    "Section2": {
      "title": "The Midnight Malady",
      "summary": "You begin to sense the restlessness of the age, when sleeplessness was considered both a moral flaw and a fashionable affliction."
    },
    "Section3": {
      "title": "Warm Milk and Wilted Lettuce",
      "summary": "In the kitchen, you sip a curious broth of boiled lettuce, favored for its soporific powers among delicate ladies and sleepless clergymen."
    },
    "Section4": {
      "title": "Whispers of Herbal Lore",
      "summary": "You breathe in the faint aroma of valerian root and hop pillows, drifting past cabinets lined with tonics, teas, and tinctures."
    },
    "Section5": {
      "title": "Electric Dreams in Tin Helmets",
      "summary": "In a physician’s dim study, you try on a humming metal contraption, pulsing with hope and the promise of rest through galvanic current."
    },
    "Section6": {
      "title": "The Physician’s Bedside Manner",
      "summary": "You observe the calm, measured tones of a Victorian sleep doctor prescribing fresh air, hydrotherapy, and long walks in petticoats."
    },
    "Section7": {
      "title": "The Rest Cure Retreat",
      "summary": "You arrive at a serene countryside asylum, where silence, solitude, and heavy blankets are prescribed in equal measure."
    },
    "Section8": {
      "title": "Clockwork Remedies and Sleep Tinctures",
      "summary": "As gears tick and bottles clink, you explore chemist shops brimming with laudanum, bromides, and promises in glass vials."
    },
    "Section9": {
      "title": "Hypnotic Voices and Mesmer Eyes",
      "summary": "You close your eyes as a gentle voice guides you deeper, exploring the mesmerist’s parlor where minds are soothed into sleep."
    },
    "Section10": {
      "title": "Fainting Couches and Feather Beds",
      "summary": "You lie back in embroidered elegance, testing the plush theories of comfort and posture whispered by early sleep ergonomists."
    },
    "Section11": {
      "title": "The Industrial Insomniac",
      "summary": "You hear the factory whistle in the distance and feel the tension of a sleepless world pushed forward by steam and stress."
    },
    "Section12": {
      "title": "Lunar Tides and Sleeping Hours",
      "summary": "You gaze out the window at the moonlit sky, pondering strange Victorian beliefs about lunar influence and ideal bedtimes."
    },
    "Section13": {
      "title": "Sleep by Social Class",
      "summary": "You walk through households high and low, from velvet-draped bedrooms to coal-stained cots, seeing how sleep was shaped by station."
    },
    "Section14": {
      "title": "The Mind in the Mattress",
      "summary": "As you rest in an antiquated spring bed, you reflect on the era’s theories connecting mental tranquility with restful slumber."
    },
    "Section15": {
      "title": "Twilight and Modern Dreams",
      "summary": "You awaken gently to the present, carrying with you the quiet curiosities of a bygone age still echoing in tonight’s sleep."
    }
  }
}