{
  "topic": "A Gentle Stroll Through Victorian Insomnia Cures, From Lettuce Soup to Electric Helmets",
  "sections": {
    "Section1": {
      "title": "Night Falls on a Sleepless Age",
      "summary": "The gaslights dim across Victorian London, and you find yourself awake—haunted not by ghosts, but by the quiet ache of sleeplessness."
    },
    "Section2": {
      "title": "The Bedchamber and Its Burdens",
      "summary": "You walk through velvet-draped bedrooms, where nervous minds and stiff corsets conspire against restful dreams."
    },
    "Section3": {
      "title": "Whispers from the Apothecary",
      "summary": "You drift into the cramped shops of herbalists, where glass vials glimmer with syrups, tonics, and the promise of slumber."
    },
    "Section4": {
      "title": "Lettuce Broth at Midnight",
      "summary": "A bowl of warm lettuce soup rests in your hands, steam curling upward like a lullaby for the weary."
    },
    "Section5": {
      "title": "The Ticking of Tinctures",
      "summary": "You explore curious elixirs—of opium, valerian, and laudanum—each measured drop a desperate hope for peace."
    },
    "Section6": {
      "title": "The Physician’s Shadow",
      "summary": "Under the stern gaze of a Victorian doctor, you are prescribed sleep as ritual: warm baths, quiet prayers, and stillness."
    },
    "Section7": {
      "title": "Tales of the Hollow Bed",
      "summary": "You lie awake in a chamber lined with journals, where insomnia is recorded as a moral failing and spiritual crisis."
    },
    "Section8": {
      "title": "A Spoonful of Chloral",
      "summary": "In a softly lit study, you take a measured dose of chloral hydrate—sweetened poison for the sleepless mind."
    },
    "Section9": {
      "title": "Feathers, Friction, and Sound",
      "summary": "You test exotic remedies: sandbags on the stomach, feather mattresses, and metronomes—strange symphonies for stubborn minds."
    },
    "Section10": {
      "title": "The Humming Helmet",
      "summary": "You settle beneath an electric helmet, wires pulsing faintly, as physicians experiment with sleep through modern sparks."
    },
    "Section11": {
      "title": "Society’s Sleepless Women",
      "summary": "You wander parlors and sanatoriums where women, labeled as ‘hysterics,’ lie beneath cold compresses and whispered judgments."
    },
    "Section12": {
      "title": "Dreams of Mesmer and Magnetism",
      "summary": "In a candlelit drawing room, a mesmerist’s fingers pass over your brow, guiding your thoughts toward twilight."
    },
    "Section13": {
      "title": "A Stroll Through the Night Garden",
      "summary": "You step into moonlit gardens, where gentle walks and botanical aromas are said to coax the mind into rest."
    },
    "Section14": {
      "title": "The Clock Slows to Silence",
      "summary": "As you sink into cushions and candlelight, you reflect on the timeless quest to master sleep’s mysteries."
    },
    "Section15": {
      "title": "A Stillness in the Smoke",
      "summary": "At last, the fog parts and the hush settles in—you close your eyes, lulled by the quiet wonder of it all."
    }
  }
}