{
  "topic": "Why a Medieval French Pig Was Once Put on Trial for Murder",
  "sections": {
    "Section1": {
      "title": "The Bell Tolls in Falaise",
      "summary": "You wake to a hush in the village of Falaise, where townsfolk gather near the gallows—eyes not on a man, but a pig in chains."
    },
    "Section2": {
      "title": "Blood in the Street",
      "summary": "You step through cobbled lanes, where rumor spreads: a child is dead, and the culprit wears a snout and hooves."
    },
    "Section3": {
      "title": "The Bailiff Arrives",
      "summary": "You watch as a stern bailiff approaches, parchment in hand, prepared to summon a sow to court as though it were a man."
    },
    "Section4": {
      "title": "The Law of Beasts",
      "summary": "You sink into the records of canon law and custom, where the boundary between man and beast blurs in ink and judgment."
    },
    "Section5": {
      "title": "A Pig Behind Bars",
      "summary": "In a dark, straw-littered cell, you glimpse the accused—tethered and silent—as the village prepares for trial."
    },
    "Section6": {
      "title": "The Judge’s Gavel Falls",
      "summary": "You sit in a cold, stone courtroom as robed men declare the pig’s crimes aloud, weighed by legal ceremony and belief."
    },
    "Section7": {
      "title": "A Lawyer for the Sow",
      "summary": "To your astonishment, a learned advocate rises to defend the pig, quoting scripture and philosophy in its favor."
    },
    "Section8": {
      "title": "The Town Watches in Silence",
      "summary": "You feel the eyes of peasants and nobles alike, drawn by equal parts curiosity and dread as testimony unfolds."
    },
    "Section9": {
      "title": "Echoes of Guilt and Innocence",
      "summary": "You hear villagers speak of past trials—roosters burned, bulls hanged—and wonder what justice truly means for beasts."
    },
    "Section10": {
      "title": "Verdict at Dusk",
      "summary": "As lanterns flicker, you stand still as the judge proclaims the pig guilty, with the weight of law behind every word."
    },
    "Section11": {
      "title": "A Sentence Like Any Other",
      "summary": "You witness the solemn rituals of execution prepared—not for a man, but for a creature treated as one under heaven."
    },
    "Section12": {
      "title": "The Gallows and the Crowd",
      "summary": "Under grey skies, you watch the sow led forth, her fate sealed as villagers clutch their children and cross themselves."
    },
    "Section13": {
      "title": "After the Rope Tightens",
      "summary": "The air hangs heavy as the crowd disperses; you are left with questions lingering louder than judgment."
    },
    "Section14": {
      "title": "Justice or Spectacle?",
      "summary": "You explore the echoes of this event—how fear, law, and ritual coalesced into a performance masked as justice."
    },
    "Section15": {
      "title": "The Pig That History Remembered",
      "summary": "Centuries pass, but you still hear the tale whispered in legal texts and taverns—a pig whose trial reflected the soul of its age."
    }
  }
}