{
  "topic": "How Napoleon’s Toothbrush Routine Became a Weirdly Contested Political Statement",
  "sections": {
    "Section1": {
      "title": "Night at Malmaison",
      "summary": "You wake in the quiet halls of Château de Malmaison, where whispers of Napoleon’s odd rituals echo like ghosts through marble and drapes."
    },
    "Section2": {
      "title": "The Morning Ritual Begins",
      "summary": "You watch as Napoleon’s day starts not with battle plans, but with a toothbrush—precise, methodical, and oddly ceremonial."
    },
    "Section3": {
      "title": "Of Bristles and Mint",
      "summary": "As the stiff British-made bristles scrape across enamel, you sense more than hygiene—this act is part control, part identity."
    },
    "Section4": {
      "title": "Courtiers and Imitation",
      "summary": "Around you, officers and aides mimic his routine, believing the Emperor’s brushing method to be a secret to power—or madness."
    },
    "Section5": {
      "title": "Parisian Gossip and Ink",
      "summary": "In salons and shadowy newspapers, whispers grow—Napoleon’s toothbrush isn’t just personal; it’s political, even revolutionary."
    },
    "Section6": {
      "title": "Toothpaste as Propaganda",
      "summary": "A chemist crafts a new formula, and soon, Napoleon’s paste is sold as empire in a tin—minty, imperial, and proudly French."
    },
    "Section7": {
      "title": "Enemies at the Sink",
      "summary": "Across the Channel, British satirists sketch him scrubbing frantically, weaponizing personal care into a symbol of tyranny."
    },
    "Section8": {
      "title": "The Prussian Counter-Routine",
      "summary": "In Berlin, a Prussian general adopts a rival dental ritual, claiming moral strength lies in lye soap and stoic enamel."
    },
    "Section9": {
      "title": "A Dentist’s Betrayal",
      "summary": "One of Napoleon’s dentists defects—smuggling a used toothbrush to England, where it becomes both relic and ridicule."
    },
    "Section10": {
      "title": "Toothbrush Diplomacy",
      "summary": "During tense peace talks, Napoleon gifts a custom ivory brush to an envoy, its bristles stiff with silent persuasion."
    },
    "Section11": {
      "title": "The Brushing Uniform",
      "summary": "You glimpse Napoleon donning a silk robe and mirror-polished boots just to clean his teeth—hygiene becomes theater."
    },
    "Section12": {
      "title": "Retreat and Routine",
      "summary": "In the snows of Russia, the routine persists; frostbitten troops stagger while the Emperor scrubs beneath a flickering lamp."
    },
    "Section13": {
      "title": "The Toothbrush at Elba",
      "summary": "Exiled and diminished, he clutches a travel brush, its worn bristles now a relic of empire and self-mythology."
    },
    "Section14": {
      "title": "St. Helena’s Last Brush",
      "summary": "On a humid island far from France, you watch the final brushing—slower now, deliberate, the ritual fading with breath."
    },
    "Section15": {
      "title": "Legacy in Ivory and Mint",
      "summary": "Years later, museums and monarchs argue over fragments of his dental tools—tiny artifacts charged with politics, obsession, and myth."
    }
  }
}